Reports/Биоритмы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>Биоритмы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КомандаИлиИгрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНедель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВыходныеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ПеремещенияИгроков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПеремещенияИгроков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Амплуа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Амплуа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/Биоритмы/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Перемещения.Период КАК Дата
	                      |ИЗ
	                      |	РегистрСведений.ПеремещенияИгроков КАК Перемещения");
	Если Запрос.Выполнить().Пустой() Тогда
		Отказ = Истина;
	ИначеЕсли Параметры.Свойство("Игрок") Тогда
		ЭтаФорма.АвтоматическоеСохранениеДанныхВНастройках = АвтоматическоеСохранениеДанныхФормыВНастройках.НеИспользовать;
		Отчет.КомандаИлиИгрок	= Параметры.Игрок;
		Отчет.НачальнаяДата		= ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ГрафикОбновить()
	Если Год(Отчет.НачальнаяДата) < 2 Тогда
		Отчет.НачальнаяДата	= ТекущаяДата();
	КонецЕсли;
	Если Отчет.КоличествоНедель = 0 Тогда
		Отчет.КоличествоНедель = 5;
	КонецЕсли;
	График.Очистить();
	
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) КАК Количество
	      	               |ИЗ
	      	               |	Справочник.Игроки КАК Игроки
	      	               |ГДЕ
	      	               |	Игроки.Ссылка = &КомандаИлиИгрок
	      	               |	И ГОД(Игроки.ДатаРождения) > 1900");
	Если ТипЗнч(Отчет.КомандаИлиИгрок) = Тип("СправочникСсылка.Команды") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	РАЗНОСТЬДАТ(Перемещения.Игрок.ДатаРождения, &Дата, ДЕНЬ) КАК Количество,
		               |	Перемещения.Игрок КАК Игрок
		               |ИЗ
		               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(
		               |			,
		               |			Игрок.ПометкаУдаления = ЛОЖЬ
		               |				И ГОД(Игрок.ДатаРождения) > 1900) КАК Перемещения
		               |ГДЕ
		               |	Перемещения.Команда = &КомандаИлиИгрок";
	КонецЕсли;
	Запрос.УстановитьПараметр("КомандаИлиИгрок",	Отчет.КомандаИлиИгрок);
	Запрос.УстановитьПараметр("Дата",				Отчет.НачальнаяДата);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Для тЭлемент=1 По 3 Цикл
		Серия	= График.УстановитьСерию(Биоритмы.ФЭИ(тЭлемент));
		Итера	= -1;
		Шагомер	= 0;
		Пока Шагомер < Отчет.КоличествоНедель * 7 Цикл
			Итера	= Итера + 1;
			Если Отчет.ТолькоВыходныеДни И ДеньНедели(Отчет.НачальнаяДата + Сутки(Итера)) < 6 Тогда
				Продолжить;
			КонецЕсли;
			Выборка.Сбросить();

			КолИтого	= 0;
			ВесИтого	= 0;
			Пока Выборка.Следующий() Цикл
				КолИтого	= КолИтого + 1;
				ВесИтого	= ВесИтого + Биоритмы.ФазаРасчитать2(Выборка.Количество + Итера, тЭлемент);
			КонецЦикла;
			График.УстановитьЗначение(График.УстановитьТочку(Формат(Отчет.НачальнаяДата + Сутки(Итера), "ДФ=dd.MM")), Серия, Окр(ВесИтого / КолИтого, 1));
			
			Шагомер	= Шагомер + 1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если ПустаяСтрока(Отчет.КомандаИлиИгрок) Тогда
	//	Сообщить("Добро пожаловать!");
	////ИначеЕсли ЭтаФорма.Свойство("КомандаИлиИгрок") Тогда
	////	Отчет.КомандаИлиИгрок	= Параметры.КомандаИлиИгрок;
	////	Отчет.НачальнаяДата		= ТекущаяДата();
	//КонецЕсли;
	ГрафикОбновить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаИлиИгрокПриИзменении(Элемент)
	ГрафикОбновить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаИлиИгрокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДанныеВыбора = Новый Структура("ТолькоПросмотр", Истина);
	Если ТипЗнч(Отчет.КомандаИлиИгрок) = Тип("СправочникСсылка.Игроки") Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.Игроки.ФормаВыбора", Новый Структура("Отбор", ДанныеВыбора.Вставить("ТекущаяКоманда", СерверныйФункции.Команда(Отчет.КомандаИлиИгрок, Отчет.НачальнаяДата))), Элемент);
	ИначеЕсли ТипЗнч(Отчет.КомандаИлиИгрок) = Тип("СправочникСсылка.Команды") Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(Отчет.КомандаИлиИгрок) Тогда
			ДанныеВыбора.Вставить("ТекущаяСтрока", Отчет.КомандаИлиИгрок);
		Иначе
			МояКоманда = СерверныйФункции.МояКоманда();
			Если ЗначениеЗаполнено(МояКоманда) Тогда
				ДанныеВыбора.Вставить("ТекущаяСтрока", МояКоманда);
			КонецЕсли;
		КонецЕсли;
		ОткрытьФорму("Справочник.Команды.Форма.ФормаВыбора", ДанныеВыбора, Элемент);
	КонецЕсли;
КонецПроцедуры
